{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/user/graph2nosql/.venv-g2nsql/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "from google.cloud import bigquery\n",
    "import google.auth\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "import os\n",
    "import json\n",
    "from dotenv import dotenv_values\n",
    "import time\n",
    "\n",
    "from main import NodeImportBenchmark, NodeQueryBenchmark\n",
    "\n",
    "from base.operations import NoSQLKnowledgeGraph\n",
    "from databases.firestore_kg import FirestoreKG\n",
    "from databases.n4j import AuraKG\n",
    "from databases.mdb import MongoKG\n",
    "\n",
    "from datamodel.data_model import NodeData, EdgeData, CommunityData"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Setting env and global variables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "secrets = dotenv_values(\"../.env\")\n",
    "credentials, _ = google.auth.load_credentials_from_file(secrets[\"GCP_CREDENTIAL_FILE\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Firestore Knowledge Graph vs. AuraDB (Neo4J) latency comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Define Knowledge Graph DB Interface Options"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pinged your deployment. You successfully connected to MongoDB!\n"
     ]
    }
   ],
   "source": [
    "fskg = FirestoreKG(gcp_credential_file=secrets[\"GCP_CREDENTIAL_FILE\"],\n",
    "                   gcp_project_id=str(secrets[\"GCP_PROJECT_ID\"]),\n",
    "                   firestore_db_id=str(secrets[\"WIKIDATA_FS_DB\"]),\n",
    "                   node_collection_id=str(secrets[\"NODE_COLL_ID\"]),\n",
    "                   edges_collection_id=str(secrets[\"EDGES_COLL_ID\"]),\n",
    "                   community_collection_id=str(\n",
    "                       secrets[\"COMM_COLL_ID\"])\n",
    "                   )\n",
    "\n",
    "aura_kg = AuraKG(uri=str(secrets[\"NEO4J_URI\"]),\n",
    "                 auth=(str(secrets[\"NEO4J_USERNAME\"]),\n",
    "                       str(secrets[\"NEO4J_PASSWORD\"]))\n",
    "                 )\n",
    "\n",
    "mdb_username = str(secrets[\"MDB_USERNAME\"])\n",
    "mdb_passowrd = str(secrets[\"MDB_PASSWORD\"])\n",
    "mdb_cluster = str(secrets[\"MDB_CLUSTER\"])\n",
    "mdb_uri = f\"mongodb+srv://{mdb_username}:{mdb_passowrd}@cluster0.pjx3w.mongodb.net/?retryWrites=true&w=majority&appName={mdb_cluster}\"\n",
    "\n",
    "mkg = MongoKG(\n",
    "    mdb_uri=mdb_uri,\n",
    "    mdb_db_id=str(secrets[\"MDB_DB_ID\"]),\n",
    "    node_coll_id=str(secrets[\"NODE_COLL_ID\"]),\n",
    "    edges_coll_id=str(secrets[\"EDGES_COLL_ID\"]),\n",
    "    community_collection_id=str(secrets[\"COMM_COLL_ID\"])\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Importing Nodes Comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Fetch graph data from BigQuery"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "$$$$ Task Index 0, Task Count 1, Offset 302300\n"
     ]
    }
   ],
   "source": [
    "import_lim = 100\n",
    "task_index = int(os.getenv('CLOUD_RUN_TASK_INDEX', '0'))\n",
    "task_count = int(os.getenv('CLOUD_RUN_TASK_COUNT', '1'))\n",
    "rows_per_task = import_lim // task_count\n",
    "offset = task_index * rows_per_task + 302300\n",
    "\n",
    "print(\n",
    "    f'$$$$ Task Index {task_index}, Task Count {task_count}, Offset {offset}')\n",
    "\n",
    "# Fetch Node data from BigQuery\n",
    "client = bigquery.Client(project=str(\n",
    "    secrets[\"GCP_PROJECT_ID\"]), credentials=credentials)\n",
    "\n",
    "query_job = client.query(\n",
    "    f\"SELECT * FROM poerschmann-sem-search.wikidata_kg.entity_doc_alias_joined LIMIT {rows_per_task} OFFSET {offset}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run Node Import Benchmark"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "$$$$ Starting Benchmark Node Import with options: ['Firestore', 'Mongo', 'Aura'] $$$$\n",
      "Error adding node Q5188684 with Firestore: Error: Node with node_uid 'Q5188684' already exists.\n",
      "Error adding node Q1174461 with Firestore: Error: Node with node_uid 'Q1174461' already exists.\n",
      "Error adding node Q1221494 with Firestore: Error: Node with node_uid 'Q1221494' already exists.\n",
      "Error adding node Q2034643 with Firestore: Error: Node with node_uid 'Q2034643' already exists.\n",
      "Error adding node Q13593685 with Firestore: Error: Node with node_uid 'Q13593685' already exists.\n",
      "Error adding node Q266726 with Firestore: Error: Node with node_uid 'Q266726' already exists.\n",
      "Error adding node Q5353014 with Firestore: Error: Node with node_uid 'Q5353014' already exists.\n",
      "Error adding node Q5373282 with Firestore: Error: Node with node_uid 'Q5373282' already exists.\n",
      "Error adding node Q13540281 with Firestore: Error: Node with node_uid 'Q13540281' already exists.\n",
      "Error adding node Q13540013 with Firestore: Error: Node with node_uid 'Q13540013' already exists.\n",
      "Error adding node Q5857577 with Firestore: Error: Node with node_uid 'Q5857577' already exists.\n",
      "Error adding node Q5466030 with Firestore: Error: Node with node_uid 'Q5466030' already exists.\n",
      "Error adding node Q95535 with Firestore: Error: Node with node_uid 'Q95535' already exists.\n",
      "Error adding node Q533793 with Firestore: Error: Node with node_uid 'Q533793' already exists.\n",
      "Error adding node Q1417133 with Firestore: Error: Node with node_uid 'Q1417133' already exists.\n",
      "Error adding node Q2014380 with Firestore: Error: Node with node_uid 'Q2014380' already exists.\n",
      "Error adding node Q693983 with Firestore: Error: Node with node_uid 'Q693983' already exists.\n",
      "Error adding node Q5596007 with Firestore: Error: Node with node_uid 'Q5596007' already exists.\n",
      "Error adding node Q529234 with Firestore: Error: Node with node_uid 'Q529234' already exists.\n",
      "Error adding node Q5637448 with Firestore: Error: Node with node_uid 'Q5637448' already exists.\n",
      "Error adding node Q552483 with Firestore: Error: Node with node_uid 'Q552483' already exists.\n",
      "Error adding node Q5733848 with Firestore: Error: Node with node_uid 'Q5733848' already exists.\n",
      "Error adding node Q727142 with Firestore: Error: Node with node_uid 'Q727142' already exists.\n",
      "Error adding node Q18027193 with Firestore: Error: Node with node_uid 'Q18027193' already exists.\n",
      "Error adding node Q5958300 with Firestore: Error: Node with node_uid 'Q5958300' already exists.\n",
      "Error adding node Q16735220 with Firestore: Error: Node with node_uid 'Q16735220' already exists.\n",
      "Error adding node Q18027700 with Firestore: Error: Node with node_uid 'Q18027700' already exists.\n",
      "Error adding node Q6126531 with Firestore: Error: Node with node_uid 'Q6126531' already exists.\n",
      "Error adding node Q6142053 with Firestore: Error: Node with node_uid 'Q6142053' already exists.\n",
      "Error adding node Q491965 with Firestore: Error: Node with node_uid 'Q491965' already exists.\n",
      "Error adding node Q6353829 with Firestore: Error: Node with node_uid 'Q6353829' already exists.\n",
      "Error adding node Q6376940 with Firestore: Error: Node with node_uid 'Q6376940' already exists.\n",
      "Error adding node Q18033477 with Firestore: Error: Node with node_uid 'Q18033477' already exists.\n",
      "Error adding node Q6454236 with Firestore: Error: Node with node_uid 'Q6454236' already exists.\n",
      "Error adding node Q1337491 with Firestore: Error: Node with node_uid 'Q1337491' already exists.\n",
      "Error adding node Q6521630 with Firestore: Error: Node with node_uid 'Q6521630' already exists.\n",
      "Error adding node Q28867635 with Firestore: Error: Node with node_uid 'Q28867635' already exists.\n",
      "Error adding node Q944665 with Firestore: Error: Node with node_uid 'Q944665' already exists.\n",
      "Error adding node Q3466840 with Firestore: Error: Node with node_uid 'Q3466840' already exists.\n",
      "Error adding node Q12826591 with Firestore: Error: Node with node_uid 'Q12826591' already exists.\n",
      "Error adding node Q504662 with Firestore: Error: Node with node_uid 'Q504662' already exists.\n",
      "Error adding node Q395423 with Firestore: Error: Node with node_uid 'Q395423' already exists.\n",
      "Error adding node Q328944 with Firestore: Error: Node with node_uid 'Q328944' already exists.\n",
      "Error adding node Q6874158 with Firestore: Error: Node with node_uid 'Q6874158' already exists.\n",
      "Error adding node Q23881288 with Firestore: Error: Node with node_uid 'Q23881288' already exists.\n",
      "Error adding node Q18093685 with Firestore: Error: Node with node_uid 'Q18093685' already exists.\n",
      "Error adding node Q6902439 with Firestore: Error: Node with node_uid 'Q6902439' already exists.\n",
      "Error adding node Q1159025 with Firestore: Error: Node with node_uid 'Q1159025' already exists.\n",
      "Error adding node Q6098389 with Firestore: Error: Node with node_uid 'Q6098389' already exists.\n",
      "Error adding node Q7081300 with Firestore: Error: Node with node_uid 'Q7081300' already exists.\n",
      "Error adding node Q1532857 with Firestore: Error: Node with node_uid 'Q1532857' already exists.\n",
      "Error adding node Q7115828 with Firestore: Error: Node with node_uid 'Q7115828' already exists.\n",
      "Error adding node Q14890262 with Firestore: Error: Node with node_uid 'Q14890262' already exists.\n",
      "Error adding node Q7209657 with Firestore: Error: Node with node_uid 'Q7209657' already exists.\n",
      "Error adding node Q10808666 with Firestore: Error: Node with node_uid 'Q10808666' already exists.\n",
      "Error adding node Q18042943 with Firestore: Error: Node with node_uid 'Q18042943' already exists.\n",
      "Error adding node Q4250979 with Firestore: Error: Node with node_uid 'Q4250979' already exists.\n",
      "Error adding node Q555551 with Firestore: Error: Node with node_uid 'Q555551' already exists.\n",
      "Error adding node Q7312676 with Firestore: Error: Node with node_uid 'Q7312676' already exists.\n",
      "Error adding node Q27984959 with Firestore: Error: Node with node_uid 'Q27984959' already exists.\n",
      "Error adding node Q14945739 with Firestore: Error: Node with node_uid 'Q14945739' already exists.\n",
      "Error adding node Q2356511 with Firestore: Error: Node with node_uid 'Q2356511' already exists.\n",
      "Error adding node Q119761 with Firestore: Error: Node with node_uid 'Q119761' already exists.\n",
      "Error adding node Q22134211 with Firestore: Error: Node with node_uid 'Q22134211' already exists.\n",
      "Error adding node Q18056129 with Firestore: Error: Node with node_uid 'Q18056129' already exists.\n",
      "Error adding node Q535522 with Firestore: Error: Node with node_uid 'Q535522' already exists.\n",
      "Error adding node Q1528353 with Firestore: Error: Node with node_uid 'Q1528353' already exists.\n",
      "Error adding node Q22134239 with Firestore: Error: Node with node_uid 'Q22134239' already exists.\n",
      "Error adding node Q21165905 with Firestore: Error: Node with node_uid 'Q21165905' already exists.\n",
      "Error adding node Q1607337 with Firestore: Error: Node with node_uid 'Q1607337' already exists.\n",
      "Error adding node Q7435182 with Firestore: Error: Node with node_uid 'Q7435182' already exists.\n",
      "Error adding node Q18356608 with Firestore: Error: Node with node_uid 'Q18356608' already exists.\n",
      "Error adding node Q7490524 with Firestore: Error: Node with node_uid 'Q7490524' already exists.\n",
      "Error adding node Q21030087 with Firestore: Error: Node with node_uid 'Q21030087' already exists.\n",
      "Error adding node Q7522690 with Firestore: Error: Node with node_uid 'Q7522690' already exists.\n",
      "Error adding node Q15989990 with Firestore: Error: Node with node_uid 'Q15989990' already exists.\n",
      "Error adding node Q7547303 with Firestore: Error: Node with node_uid 'Q7547303' already exists.\n",
      "Error adding node Q2503735 with Firestore: Error: Node with node_uid 'Q2503735' already exists.\n",
      "Error adding node Q3497744 with Firestore: Error: Node with node_uid 'Q3497744' already exists.\n",
      "Error adding node Q15948734 with Firestore: Error: Node with node_uid 'Q15948734' already exists.\n",
      "Error adding node Q7718686 with Firestore: Error: Node with node_uid 'Q7718686' already exists.\n",
      "Error adding node Q26546165 with Firestore: Error: Node with node_uid 'Q26546165' already exists.\n",
      "Error adding node Q18150552 with Firestore: Error: Node with node_uid 'Q18150552' already exists.\n",
      "Error adding node Q5605063 with Firestore: Error: Node with node_uid 'Q5605063' already exists.\n",
      "Error adding node Q16227863 with Firestore: Error: Node with node_uid 'Q16227863' already exists.\n",
      "Error adding node Q4615935 with Firestore: Error: Node with node_uid 'Q4615935' already exists.\n",
      "Error adding node Q17560838 with Firestore: Error: Node with node_uid 'Q17560838' already exists.\n",
      "Error adding node Q1863428 with Firestore: Error: Node with node_uid 'Q1863428' already exists.\n",
      "Error adding node Q16080456 with Firestore: Error: Node with node_uid 'Q16080456' already exists.\n",
      "Error adding node Q1137126 with Firestore: Error: Node with node_uid 'Q1137126' already exists.\n",
      "Error adding node Q27664139 with Firestore: Error: Node with node_uid 'Q27664139' already exists.\n",
      "Error adding node Q7805623 with Firestore: Error: Node with node_uid 'Q7805623' already exists.\n",
      "Error adding node Q18204628 with Firestore: Error: Node with node_uid 'Q18204628' already exists.\n",
      "Error adding node Q3247556 with Firestore: Error: Node with node_uid 'Q3247556' already exists.\n",
      "Error adding node Q3991245 with Firestore: Error: Node with node_uid 'Q3991245' already exists.\n",
      "Error adding node Q24806746 with Firestore: Error: Node with node_uid 'Q24806746' already exists.\n",
      "Error adding node Q2989984 with Firestore: Error: Node with node_uid 'Q2989984' already exists.\n",
      "Error adding node Q18031960 with Firestore: Error: Node with node_uid 'Q18031960' already exists.\n",
      "Error adding node Q581527 with Firestore: Error: Node with node_uid 'Q581527' already exists.\n",
      "Error adding node Q887148 with Firestore: Error: Node with node_uid 'Q887148' already exists.\n",
      "Error adding node Q5188684 with Mongo: \"Error: Node with node_uid 'Q5188684' already exists.\"\n",
      "Error adding node Q1174461 with Mongo: \"Error: Node with node_uid 'Q1174461' already exists.\"\n",
      "Error adding node Q1221494 with Mongo: \"Error: Node with node_uid 'Q1221494' already exists.\"\n",
      "Error adding node Q2034643 with Mongo: \"Error: Node with node_uid 'Q2034643' already exists.\"\n",
      "Error adding node Q13593685 with Mongo: \"Error: Node with node_uid 'Q13593685' already exists.\"\n",
      "Error adding node Q266726 with Mongo: \"Error: Node with node_uid 'Q266726' already exists.\"\n",
      "Error adding node Q5353014 with Mongo: \"Error: Node with node_uid 'Q5353014' already exists.\"\n",
      "Error adding node Q5373282 with Mongo: \"Error: Node with node_uid 'Q5373282' already exists.\"\n",
      "Error adding node Q13540281 with Mongo: \"Error: Node with node_uid 'Q13540281' already exists.\"\n",
      "Error adding node Q13540013 with Mongo: \"Error: Node with node_uid 'Q13540013' already exists.\"\n",
      "Error adding node Q5857577 with Mongo: \"Error: Node with node_uid 'Q5857577' already exists.\"\n",
      "Error adding node Q5466030 with Mongo: \"Error: Node with node_uid 'Q5466030' already exists.\"\n",
      "Error adding node Q95535 with Mongo: \"Error: Node with node_uid 'Q95535' already exists.\"\n",
      "Error adding node Q533793 with Mongo: \"Error: Node with node_uid 'Q533793' already exists.\"\n",
      "Error adding node Q1417133 with Mongo: \"Error: Node with node_uid 'Q1417133' already exists.\"\n",
      "Error adding node Q2014380 with Mongo: \"Error: Node with node_uid 'Q2014380' already exists.\"\n",
      "Error adding node Q693983 with Mongo: \"Error: Node with node_uid 'Q693983' already exists.\"\n",
      "Error adding node Q5596007 with Mongo: \"Error: Node with node_uid 'Q5596007' already exists.\"\n",
      "Error adding node Q529234 with Mongo: \"Error: Node with node_uid 'Q529234' already exists.\"\n",
      "Error adding node Q5637448 with Mongo: \"Error: Node with node_uid 'Q5637448' already exists.\"\n",
      "Error adding node Q552483 with Mongo: \"Error: Node with node_uid 'Q552483' already exists.\"\n",
      "Error adding node Q5733848 with Mongo: \"Error: Node with node_uid 'Q5733848' already exists.\"\n",
      "Error adding node Q727142 with Mongo: \"Error: Node with node_uid 'Q727142' already exists.\"\n",
      "Error adding node Q18027193 with Mongo: \"Error: Node with node_uid 'Q18027193' already exists.\"\n",
      "Error adding node Q5958300 with Mongo: \"Error: Node with node_uid 'Q5958300' already exists.\"\n",
      "Error adding node Q16735220 with Mongo: \"Error: Node with node_uid 'Q16735220' already exists.\"\n",
      "Error adding node Q18027700 with Mongo: \"Error: Node with node_uid 'Q18027700' already exists.\"\n",
      "Error adding node Q6126531 with Mongo: \"Error: Node with node_uid 'Q6126531' already exists.\"\n",
      "Error adding node Q6142053 with Mongo: \"Error: Node with node_uid 'Q6142053' already exists.\"\n",
      "Error adding node Q491965 with Mongo: \"Error: Node with node_uid 'Q491965' already exists.\"\n",
      "Error adding node Q6353829 with Mongo: \"Error: Node with node_uid 'Q6353829' already exists.\"\n",
      "Error adding node Q6376940 with Mongo: \"Error: Node with node_uid 'Q6376940' already exists.\"\n",
      "Error adding node Q18033477 with Mongo: \"Error: Node with node_uid 'Q18033477' already exists.\"\n",
      "Error adding node Q6454236 with Mongo: \"Error: Node with node_uid 'Q6454236' already exists.\"\n",
      "Error adding node Q1337491 with Mongo: \"Error: Node with node_uid 'Q1337491' already exists.\"\n",
      "Error adding node Q6521630 with Mongo: \"Error: Node with node_uid 'Q6521630' already exists.\"\n",
      "Error adding node Q28867635 with Mongo: \"Error: Node with node_uid 'Q28867635' already exists.\"\n",
      "Error adding node Q944665 with Mongo: \"Error: Node with node_uid 'Q944665' already exists.\"\n",
      "Error adding node Q3466840 with Mongo: \"Error: Node with node_uid 'Q3466840' already exists.\"\n",
      "Error adding node Q12826591 with Mongo: \"Error: Node with node_uid 'Q12826591' already exists.\"\n",
      "Error adding node Q504662 with Mongo: \"Error: Node with node_uid 'Q504662' already exists.\"\n",
      "Error adding node Q395423 with Mongo: \"Error: Node with node_uid 'Q395423' already exists.\"\n",
      "Error adding node Q328944 with Mongo: \"Error: Node with node_uid 'Q328944' already exists.\"\n",
      "Error adding node Q6874158 with Mongo: \"Error: Node with node_uid 'Q6874158' already exists.\"\n",
      "Error adding node Q23881288 with Mongo: \"Error: Node with node_uid 'Q23881288' already exists.\"\n",
      "Error adding node Q18093685 with Mongo: \"Error: Node with node_uid 'Q18093685' already exists.\"\n",
      "Error adding node Q6902439 with Mongo: \"Error: Node with node_uid 'Q6902439' already exists.\"\n",
      "Error adding node Q1159025 with Mongo: \"Error: Node with node_uid 'Q1159025' already exists.\"\n",
      "Error adding node Q6098389 with Mongo: \"Error: Node with node_uid 'Q6098389' already exists.\"\n",
      "Error adding node Q7081300 with Mongo: \"Error: Node with node_uid 'Q7081300' already exists.\"\n",
      "Error adding node Q1532857 with Mongo: \"Error: Node with node_uid 'Q1532857' already exists.\"\n",
      "Error adding node Q7115828 with Mongo: \"Error: Node with node_uid 'Q7115828' already exists.\"\n",
      "Error adding node Q14890262 with Mongo: \"Error: Node with node_uid 'Q14890262' already exists.\"\n",
      "Error adding node Q7209657 with Mongo: \"Error: Node with node_uid 'Q7209657' already exists.\"\n",
      "Error adding node Q10808666 with Mongo: \"Error: Node with node_uid 'Q10808666' already exists.\"\n",
      "Error adding node Q18042943 with Mongo: \"Error: Node with node_uid 'Q18042943' already exists.\"\n",
      "Error adding node Q4250979 with Mongo: \"Error: Node with node_uid 'Q4250979' already exists.\"\n",
      "Error adding node Q555551 with Mongo: \"Error: Node with node_uid 'Q555551' already exists.\"\n",
      "Error adding node Q7312676 with Mongo: \"Error: Node with node_uid 'Q7312676' already exists.\"\n",
      "Error adding node Q27984959 with Mongo: \"Error: Node with node_uid 'Q27984959' already exists.\"\n",
      "Error adding node Q14945739 with Mongo: \"Error: Node with node_uid 'Q14945739' already exists.\"\n",
      "Error adding node Q2356511 with Mongo: \"Error: Node with node_uid 'Q2356511' already exists.\"\n",
      "Error adding node Q119761 with Mongo: \"Error: Node with node_uid 'Q119761' already exists.\"\n",
      "Error adding node Q22134211 with Mongo: \"Error: Node with node_uid 'Q22134211' already exists.\"\n",
      "Error adding node Q18056129 with Mongo: \"Error: Node with node_uid 'Q18056129' already exists.\"\n",
      "Error adding node Q535522 with Mongo: \"Error: Node with node_uid 'Q535522' already exists.\"\n",
      "Error adding node Q1528353 with Mongo: \"Error: Node with node_uid 'Q1528353' already exists.\"\n",
      "Error adding node Q22134239 with Mongo: \"Error: Node with node_uid 'Q22134239' already exists.\"\n",
      "Error adding node Q21165905 with Mongo: \"Error: Node with node_uid 'Q21165905' already exists.\"\n",
      "Error adding node Q1607337 with Mongo: \"Error: Node with node_uid 'Q1607337' already exists.\"\n",
      "Error adding node Q7435182 with Mongo: \"Error: Node with node_uid 'Q7435182' already exists.\"\n",
      "Error adding node Q18356608 with Mongo: \"Error: Node with node_uid 'Q18356608' already exists.\"\n",
      "Error adding node Q7490524 with Mongo: \"Error: Node with node_uid 'Q7490524' already exists.\"\n",
      "Error adding node Q21030087 with Mongo: \"Error: Node with node_uid 'Q21030087' already exists.\"\n",
      "Error adding node Q7522690 with Mongo: \"Error: Node with node_uid 'Q7522690' already exists.\"\n",
      "Error adding node Q15989990 with Mongo: \"Error: Node with node_uid 'Q15989990' already exists.\"\n",
      "Error adding node Q7547303 with Mongo: \"Error: Node with node_uid 'Q7547303' already exists.\"\n",
      "Error adding node Q2503735 with Mongo: \"Error: Node with node_uid 'Q2503735' already exists.\"\n",
      "Error adding node Q3497744 with Mongo: \"Error: Node with node_uid 'Q3497744' already exists.\"\n",
      "Error adding node Q15948734 with Mongo: \"Error: Node with node_uid 'Q15948734' already exists.\"\n",
      "Error adding node Q7718686 with Mongo: \"Error: Node with node_uid 'Q7718686' already exists.\"\n",
      "Error adding node Q26546165 with Mongo: \"Error: Node with node_uid 'Q26546165' already exists.\"\n",
      "Error adding node Q18150552 with Mongo: \"Error: Node with node_uid 'Q18150552' already exists.\"\n",
      "Error adding node Q5605063 with Mongo: \"Error: Node with node_uid 'Q5605063' already exists.\"\n",
      "Error adding node Q16227863 with Mongo: \"Error: Node with node_uid 'Q16227863' already exists.\"\n",
      "Error adding node Q4615935 with Mongo: \"Error: Node with node_uid 'Q4615935' already exists.\"\n",
      "Error adding node Q17560838 with Mongo: \"Error: Node with node_uid 'Q17560838' already exists.\"\n",
      "Error adding node Q1863428 with Mongo: \"Error: Node with node_uid 'Q1863428' already exists.\"\n",
      "Error adding node Q16080456 with Mongo: \"Error: Node with node_uid 'Q16080456' already exists.\"\n",
      "Error adding node Q1137126 with Mongo: \"Error: Node with node_uid 'Q1137126' already exists.\"\n",
      "Error adding node Q27664139 with Mongo: \"Error: Node with node_uid 'Q27664139' already exists.\"\n",
      "Error adding node Q7805623 with Mongo: \"Error: Node with node_uid 'Q7805623' already exists.\"\n",
      "Error adding node Q18204628 with Mongo: \"Error: Node with node_uid 'Q18204628' already exists.\"\n",
      "Error adding node Q3247556 with Mongo: \"Error: Node with node_uid 'Q3247556' already exists.\"\n",
      "Error adding node Q3991245 with Mongo: \"Error: Node with node_uid 'Q3991245' already exists.\"\n",
      "Error adding node Q24806746 with Mongo: \"Error: Node with node_uid 'Q24806746' already exists.\"\n",
      "Error adding node Q2989984 with Mongo: \"Error: Node with node_uid 'Q2989984' already exists.\"\n",
      "Error adding node Q18031960 with Mongo: \"Error: Node with node_uid 'Q18031960' already exists.\"\n",
      "Error adding node Q581527 with Mongo: \"Error: Node with node_uid 'Q581527' already exists.\"\n",
      "Error adding node Q887148 with Mongo: \"Error: Node with node_uid 'Q887148' already exists.\"\n",
      "Firestore time for 100 Node Import: 1.6441571712493896\n",
      "Mongo time for 100 Node Import: 0.44902729988098145\n",
      "Aura time for 100 Node Import: 2.1255929470062256\n",
      "hEllO wOrlD!\n"
     ]
    }
   ],
   "source": [
    "add_nodes_testing = NodeImportBenchmark(\n",
    "    benchmark_name=\"Node Import\", import_lim=import_lim, options_dict={\"Firestore\": fskg, \"Mongo\": mkg, \"Aura\": aura_kg})\n",
    "add_nodes_testing(records=query_job)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying Nodes Comparison"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "$$$$ Starting Benchmark Node Query with options: ['Firestore', 'Mongo', 'Aura'] $$$$\n",
      "Firestore time for 100 Node Query: 1.0908563137054443\n",
      "Mongo time for 100 Node Query: 0.529088020324707\n",
      "Aura time for 100 Node Query: 8.03442120552063\n",
      "hEllO wOrlD!\n"
     ]
    }
   ],
   "source": [
    "query_nodes_testing = NodeQueryBenchmark(\n",
    "    benchmark_name=\"Node Query\", import_lim=import_lim, options_dict={\"Firestore\": fskg, \"Mongo\": mkg, \"Aura\": aura_kg})\n",
    "query_nodes_testing(records=query_job)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying deeply nested structures comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Challenge: Finding friends of friends of \"Q901\" (2nd degree directed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "113"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f0f_list = []\n",
    "\n",
    "node_data = fskg.get_node(node_uid='Q901')\n",
    "\n",
    "for e in node_data.edges_from:\n",
    "    neigh_node = fskg.get_node(node_uid=e)\n",
    "    f0f_list.append(neigh_node.edges_from)\n",
    "\n",
    "len(sum(f0f_list, []))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# f0f_list = []\n",
    "\n",
    "# node_data = mkg.get_node(node_uid='Q901')\n",
    "\n",
    "# for e in node_data.edges_from:\n",
    "#     neigh_node = mkg.get_node(node_uid=e)\n",
    "#     f0f_list.append(neigh_node.edges_from)\n",
    "\n",
    "# len(sum(f0f_list, []))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "f0f_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "53"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records, summary, keys = aura_kg.driver.execute_query(\n",
    "        \"MATCH (n)-[]-()-[]-(result) WHERE n.node_uid = 'Q901' RETURN result\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "53"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records, summary, keys = aura_kg.driver.execute_query(\n",
    "        \"\"\"MATCH (n)-[:DIRECTED]-()-[:DIRECTED]-(result)\n",
    "            WHERE n.node_uid = 'Q901'\n",
    "            RETURN result\"\"\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "53"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records, summary, keys = aura_kg.driver.execute_query(\n",
    "        \"\"\"MATCH (n)-[:DIRECTED*2]-(result)\n",
    "            WHERE n.node_uid = 'Q901'\n",
    "            RETURN result\"\"\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Challenge 2: Finding friends of friends of friends \"Q901\" (3rd degree undirected)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "51947"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f0fof_list = []\n",
    "\n",
    "node_data = fskg.get_node(node_uid='Q901')\n",
    "\n",
    "for e in node_data.edges_from + node_data.edges_to:\n",
    "    neigh_node = fskg.get_node(node_uid=e)\n",
    "    for e2 in neigh_node.edges_from + neigh_node.edges_to:\n",
    "        neigh_node2 = fskg.get_node(node_uid=e2)\n",
    "        f0fof_list.append(neigh_node2.edges_from)\n",
    "        f0fof_list.append(neigh_node2.edges_to)\n",
    "\n",
    "len(sum(f0fof_list, []))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "10078"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with GraphDatabase.driver(uri=aura_kg.uri, auth=aura_kg.auth) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    # Use a parameter for node_uid in the Cypher query\n",
    "    records, summary, keys = driver.execute_query(\n",
    "        \"MATCH (n)-[]-()-[]-()-[]-(result) WHERE n.node_uid = 'Q901' RETURN result\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Running Community Identification Comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "tbd in comparison"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
