{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/user/graph2nosql/.venv-g2nsql/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "from google.cloud import bigquery\n",
    "import google.auth\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "import os\n",
    "import json\n",
    "from dotenv import dotenv_values\n",
    "import time\n",
    "\n",
    "from main import NodeImportBenchmark, NodeQueryBenchmark\n",
    "\n",
    "from base.operations import NoSQLKnowledgeGraph\n",
    "from databases.firestore_kg import FirestoreKG\n",
    "from databases.n4j import AuraKG\n",
    "from databases.mdb import MongoKG\n",
    "\n",
    "from datamodel.data_model import NodeData, EdgeData, CommunityData"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Setting env and global variables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "secrets = dotenv_values(\"../.env\")\n",
    "credentials, _ = google.auth.load_credentials_from_file(secrets[\"GCP_CREDENTIAL_FILE\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Firestore Knowledge Graph vs. AuraDB (Neo4J) latency comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Define Knowledge Graph DB Interface Options"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pinged your deployment. You successfully connected to MongoDB!\n"
     ]
    }
   ],
   "source": [
    "fskg = FirestoreKG(gcp_credential_file=secrets[\"GCP_CREDENTIAL_FILE\"],\n",
    "                   gcp_project_id=str(secrets[\"GCP_PROJECT_ID\"]),\n",
    "                   firestore_db_id=str(secrets[\"WIKIDATA_FS_DB\"]),\n",
    "                   node_collection_id=str(secrets[\"NODE_COLL_ID\"]),\n",
    "                   edges_collection_id=str(secrets[\"EDGES_COLL_ID\"]),\n",
    "                   community_collection_id=str(\n",
    "                       secrets[\"COMM_COLL_ID\"])\n",
    "                   )\n",
    "\n",
    "aura_kg = AuraKG(uri=str(secrets[\"NEO4J_URI\"]),\n",
    "                 auth=(str(secrets[\"NEO4J_USERNAME\"]),\n",
    "                       str(secrets[\"NEO4J_PASSWORD\"]))\n",
    "                 )\n",
    "\n",
    "mdb_username = str(secrets[\"MDB_USERNAME\"])\n",
    "mdb_passowrd = str(secrets[\"MDB_PASSWORD\"])\n",
    "mdb_cluster = str(secrets[\"MDB_CLUSTER\"])\n",
    "mdb_uri = f\"mongodb+srv://{mdb_username}:{mdb_passowrd}@cluster0.pjx3w.mongodb.net/?retryWrites=true&w=majority&appName={mdb_cluster}\"\n",
    "\n",
    "mkg = MongoKG(\n",
    "    mdb_uri=mdb_uri,\n",
    "    mdb_db_id=str(secrets[\"MDB_DB_ID\"]),\n",
    "    node_coll_id=str(secrets[\"NODE_COLL_ID\"]),\n",
    "    edges_coll_id=str(secrets[\"EDGES_COLL_ID\"]),\n",
    "    community_collection_id=str(secrets[\"COMM_COLL_ID\"])\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Importing Nodes Comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Fetch graph data from BigQuery"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "$$$$ Task Index 0, Task Count 1, Offset 302300\n"
     ]
    }
   ],
   "source": [
    "import_lim = 100\n",
    "task_index = int(os.getenv('CLOUD_RUN_TASK_INDEX', '0'))\n",
    "task_count = int(os.getenv('CLOUD_RUN_TASK_COUNT', '1'))\n",
    "rows_per_task = import_lim // task_count\n",
    "offset = task_index * rows_per_task + 302300\n",
    "\n",
    "print(\n",
    "    f'$$$$ Task Index {task_index}, Task Count {task_count}, Offset {offset}')\n",
    "\n",
    "# Fetch Node data from BigQuery\n",
    "client = bigquery.Client(project=str(\n",
    "    secrets[\"GCP_PROJECT_ID\"]), credentials=credentials)\n",
    "\n",
    "query_job = client.query(\n",
    "    f\"SELECT * FROM poerschmann-sem-search.wikidata_kg.entity_doc_alias_joined LIMIT {rows_per_task} OFFSET {offset}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run Node Import Benchmark"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "$$$$ Starting Benchmark Node Import with options: ['Firestore', 'Mongo', 'Aura'] $$$$\n",
      "Firestore time for 100 Node Import: 3.320274591445923\n",
      "Mongo time for 100 Node Import: 2.5162739753723145\n",
      "Aura time for 100 Node Import: 1.850555419921875\n",
      "hEllO wOrlD!\n"
     ]
    }
   ],
   "source": [
    "add_nodes_testing = NodeImportBenchmark(\n",
    "    benchmark_name=\"Node Import\", import_lim=import_lim, options_dict={\"Firestore\": fskg, \"Mongo\": mkg, \"Aura\": aura_kg})\n",
    "add_nodes_testing(records=query_job)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying Nodes Comparison"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "$$$$ Starting Benchmark Node Query with options: ['Firestore', 'Mongo', 'Aura'] $$$$\n",
      "Firestore time for 100 Node Query: 0.9357259273529053\n",
      "Mongo time for 100 Node Query: 0.45427942276000977\n",
      "Aura time for 100 Node Query: 6.676049470901489\n",
      "hEllO wOrlD!\n"
     ]
    }
   ],
   "source": [
    "query_nodes_testing = NodeQueryBenchmark(\n",
    "    benchmark_name=\"Node Query\", import_lim=import_lim, options_dict={\"Firestore\": fskg, \"Mongo\": mkg, \"Aura\": aura_kg})\n",
    "query_nodes_testing(records=query_job)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying deeply nested structures comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Challenge: Finding friends of friends of \"Q901\" (2nd degree directed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "113"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f0f_list = []\n",
    "\n",
    "node_data = fskg.get_node(node_uid='Q901')\n",
    "\n",
    "for e in node_data.edges_from:\n",
    "    neigh_node = fskg.get_node(node_uid=e)\n",
    "    f0f_list.append(neigh_node.edges_from)\n",
    "\n",
    "len(sum(f0f_list, []))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# f0f_list = []\n",
    "\n",
    "# node_data = mkg.get_node(node_uid='Q901')\n",
    "\n",
    "# for e in node_data.edges_from:\n",
    "#     neigh_node = mkg.get_node(node_uid=e)\n",
    "#     f0f_list.append(neigh_node.edges_from)\n",
    "\n",
    "# len(sum(f0f_list, []))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "f0f_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "53"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records, summary, keys = aura_kg.driver.execute_query(\n",
    "        \"MATCH (n)-[]-()-[]-(result) WHERE n.node_uid = 'Q901' RETURN result\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "53"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records, summary, keys = aura_kg.driver.execute_query(\n",
    "        \"\"\"MATCH (n)-[:DIRECTED]-()-[:DIRECTED]-(result)\n",
    "            WHERE n.node_uid = 'Q901'\n",
    "            RETURN result\"\"\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "53"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "records, summary, keys = aura_kg.driver.execute_query(\n",
    "        \"\"\"MATCH (n)-[:DIRECTED*2]-(result)\n",
    "            WHERE n.node_uid = 'Q901'\n",
    "            RETURN result\"\"\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Challenge 2: Finding friends of friends of friends \"Q901\" (3rd degree undirected)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "51947"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f0fof_list = []\n",
    "\n",
    "node_data = fskg.get_node(node_uid='Q901')\n",
    "\n",
    "for e in node_data.edges_from + node_data.edges_to:\n",
    "    neigh_node = fskg.get_node(node_uid=e)\n",
    "    for e2 in neigh_node.edges_from + neigh_node.edges_to:\n",
    "        neigh_node2 = fskg.get_node(node_uid=e2)\n",
    "        f0fof_list.append(neigh_node2.edges_from)\n",
    "        f0fof_list.append(neigh_node2.edges_to)\n",
    "\n",
    "len(sum(f0fof_list, []))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "10078"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with GraphDatabase.driver(uri=aura_kg.uri, auth=aura_kg.auth) as driver:\n",
    "    driver.verify_connectivity()\n",
    "\n",
    "    # Use a parameter for node_uid in the Cypher query\n",
    "    records, summary, keys = driver.execute_query(\n",
    "        \"MATCH (n)-[]-()-[]-()-[]-(result) WHERE n.node_uid = 'Q901' RETURN result\")\n",
    "\n",
    "len(records)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Running Community Identification Comparison"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "tbd in comparison"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
